import React from 'react';
import './FooterDescription.css'

const ConditionsOfUse = () => {
    return (
        <div className='footer-desc' style={{fontSize:'16px',lineHeight:1.75, padding:'24px 40px'}}>
            <h1>서비스 이용약관</h1>
                <h2>1. 목적</h2>
                    <p>본 약관은 주식회사 퍼플아이오(이하 "회사")가 코드앤버터에 관한 모든 제품과 서비스(이하 "서비스") 및 정보를 이용함에 있어 회사와 이용자의 권리·의무 및 책임사항을 규정함을 목적으로 합니다.</p>
                <h2>2. 정의</h2>
                    <p>이 약관에서 사용하는 용어의 정의는 다음과 같으며, 그외의 용어는 개별 약관에 따릅니다.</p>
                <h2>3. 약관등의 명시와 설명 및 개정</h2>
                    <p>dddd</p>
                <h2>4. 서비스 이용 계약의 성립</h2>
                    <p>dddd</p>
                <h2>5. 회원가입</h2>
                    <p>dddd</p>
                <h2>6. 서비스의 제공 및 변경</h2>
                    <p>dddd</p>
                <h2>7. 서비스의 중단</h2>
                    <p>"회사“는 컴퓨터 등 정보통신설비의 보수, 점검 및 교체, 고장, 통신의 두절 등의 사유가 발생한 경우와 전시, 사변, 천재지변, 국가 비상사태가 발생할 우려가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다.</p>
                <h2>8. 회원 탈퇴 및 자격 상실 등</h2>
                    <p>dddd</p>
                <h2>9. 회원에 대한 통지</h2>
                    <p>dddd</p>
                <h2>10. 개인정보보호</h2>
                    <p>dddd</p>
                <h2>11. 회사의 의무</h2>
                    <p>"회사"는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 서비스를 제공하는 데 최선을 다하여야 합니다.</p>
                <h2>12. 이용자의 의무</h2>
                    <p>dddd</p>
                <h2>13. 서비스의 이용료 및 납부</h2>
                    <p>dddd</p>
                <h2>14. 저작권의 귀속 및 이용제한</h2>
                    <p>dddd</p>
                <h2>15. 정보의 제공</h2>
                    <p>dddd</p>
                <h2>16. 서비스 이용료의 환불</h2>
                    <p>dddd</p>
                <h2>17. 서비스 이용료의 과오금 환급</h2>
                    <p>dddd</p>
                <h2>18. 청약의 철회</h2>
                    <p>dddd</p>
                <h2>19. 청약 철회 등의 효과</h2>
                    <p>dddd</p>
                <h2>20. 면책조항</h2>
                    <p>dddd</p>
                <h2>21. 계약의 해지 및 손해배상</h2>
                    <p>dddd</p>
                <h2>22. 분쟁해결</h2>
                    <p>dddd</p>
                <h2>23. 재판권 및 준거법</h2>
                    <p>dddd</p>
                <h2>24. 부칙</h2>
                    <p>이 이용약관은 2024년 5월 9일 자로 시행합니다.</p>
                
        </div>
    );
};

export default ConditionsOfUse;